{"format": "layers-model", "generatedBy": "keras v3.8.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "3.8.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "layers": [{"class_name": "InputLayer", "config": {"batch_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "name": "input_layer"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "kernel_size": [8, 8], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 128, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Conv2D", "config": {"name": "conv2d_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_5", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Conv2D", "config": {"name": "conv2d_6", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_6", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "Conv2D", "config": {"name": "conv2d_7", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_7", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null, "synchronized": false}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 1024, "activation": "relu", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "rate": 0.5, "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": {"module": "keras", "class_name": "DTypePolicy", "config": {"name": "float32"}, "registered_name": null}, "units": 3, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}], "build_input_shape": [null, 224, 224, 3]}}, "training_config": {"loss": "categorical_crossentropy", "loss_weights": null, "metrics": ["accuracy"], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true, "optimizer_config": {"class_name": "SGD", "config": {"name": "SGD", "learning_rate": 0.0010000000474974513, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "momentum": 0.0, "nesterov": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of109.bin", "group1-shard2of109.bin", "group1-shard3of109.bin", "group1-shard4of109.bin", "group1-shard5of109.bin", "group1-shard6of109.bin", "group1-shard7of109.bin", "group1-shard8of109.bin", "group1-shard9of109.bin", "group1-shard10of109.bin", "group1-shard11of109.bin", "group1-shard12of109.bin", "group1-shard13of109.bin", "group1-shard14of109.bin", "group1-shard15of109.bin", "group1-shard16of109.bin", "group1-shard17of109.bin", "group1-shard18of109.bin", "group1-shard19of109.bin", "group1-shard20of109.bin", "group1-shard21of109.bin", "group1-shard22of109.bin", "group1-shard23of109.bin", "group1-shard24of109.bin", "group1-shard25of109.bin", "group1-shard26of109.bin", "group1-shard27of109.bin", "group1-shard28of109.bin", "group1-shard29of109.bin", "group1-shard30of109.bin", "group1-shard31of109.bin", "group1-shard32of109.bin", "group1-shard33of109.bin", "group1-shard34of109.bin", "group1-shard35of109.bin", "group1-shard36of109.bin", "group1-shard37of109.bin", "group1-shard38of109.bin", "group1-shard39of109.bin", "group1-shard40of109.bin", "group1-shard41of109.bin", "group1-shard42of109.bin", "group1-shard43of109.bin", "group1-shard44of109.bin", "group1-shard45of109.bin", "group1-shard46of109.bin", "group1-shard47of109.bin", "group1-shard48of109.bin", "group1-shard49of109.bin", "group1-shard50of109.bin", "group1-shard51of109.bin", "group1-shard52of109.bin", "group1-shard53of109.bin", "group1-shard54of109.bin", "group1-shard55of109.bin", "group1-shard56of109.bin", "group1-shard57of109.bin", "group1-shard58of109.bin", "group1-shard59of109.bin", "group1-shard60of109.bin", "group1-shard61of109.bin", "group1-shard62of109.bin", "group1-shard63of109.bin", "group1-shard64of109.bin", "group1-shard65of109.bin", "group1-shard66of109.bin", "group1-shard67of109.bin", "group1-shard68of109.bin", "group1-shard69of109.bin", "group1-shard70of109.bin", "group1-shard71of109.bin", "group1-shard72of109.bin", "group1-shard73of109.bin", "group1-shard74of109.bin", "group1-shard75of109.bin", "group1-shard76of109.bin", "group1-shard77of109.bin", "group1-shard78of109.bin", "group1-shard79of109.bin", "group1-shard80of109.bin", "group1-shard81of109.bin", "group1-shard82of109.bin", "group1-shard83of109.bin", "group1-shard84of109.bin", "group1-shard85of109.bin", "group1-shard86of109.bin", "group1-shard87of109.bin", "group1-shard88of109.bin", "group1-shard89of109.bin", "group1-shard90of109.bin", "group1-shard91of109.bin", "group1-shard92of109.bin", "group1-shard93of109.bin", "group1-shard94of109.bin", "group1-shard95of109.bin", "group1-shard96of109.bin", "group1-shard97of109.bin", "group1-shard98of109.bin", "group1-shard99of109.bin", "group1-shard100of109.bin", "group1-shard101of109.bin", "group1-shard102of109.bin", "group1-shard103of109.bin", "group1-shard104of109.bin", "group1-shard105of109.bin", "group1-shard106of109.bin", "group1-shard107of109.bin", "group1-shard108of109.bin", "group1-shard109of109.bin"], "weights": [{"name": "sequential/batch_normalization/gamma", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization/beta", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/gamma", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/beta", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization_1/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/gamma", "shape": [256], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/beta", "shape": [256], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "sequential/batch_normalization_2/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "sequential/batch_normalization_3/gamma", "shape": [256], "dtype": "float32"}, {"name": "sequential/batch_normalization_3/beta", "shape": [256], "dtype": "float32"}, {"name": "sequential/batch_normalization_3/moving_mean", "shape": [256], "dtype": "float32"}, {"name": "sequential/batch_normalization_3/moving_variance", "shape": [256], "dtype": "float32"}, {"name": "sequential/batch_normalization_4/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_4/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_4/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_4/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_5/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_5/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_5/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_5/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_6/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_6/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_6/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_6/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_7/gamma", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_7/beta", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_7/moving_mean", "shape": [512], "dtype": "float32"}, {"name": "sequential/batch_normalization_7/moving_variance", "shape": [512], "dtype": "float32"}, {"name": "sequential/conv2d/kernel", "shape": [8, 8, 3, 128], "dtype": "float32"}, {"name": "sequential/conv2d/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential/conv2d_1/kernel", "shape": [5, 5, 128, 128], "dtype": "float32"}, {"name": "sequential/conv2d_1/bias", "shape": [128], "dtype": "float32"}, {"name": "sequential/conv2d_2/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "sequential/conv2d_2/bias", "shape": [256], "dtype": "float32"}, {"name": "sequential/conv2d_3/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "sequential/conv2d_3/bias", "shape": [256], "dtype": "float32"}, {"name": "sequential/conv2d_4/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "sequential/conv2d_4/bias", "shape": [512], "dtype": "float32"}, {"name": "sequential/conv2d_5/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "sequential/conv2d_5/bias", "shape": [512], "dtype": "float32"}, {"name": "sequential/conv2d_6/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "sequential/conv2d_6/bias", "shape": [512], "dtype": "float32"}, {"name": "sequential/conv2d_7/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "sequential/conv2d_7/bias", "shape": [512], "dtype": "float32"}, {"name": "sequential/dense/kernel", "shape": [100352, 1024], "dtype": "float32"}, {"name": "sequential/dense/bias", "shape": [1024], "dtype": "float32"}, {"name": "sequential/dense_1/kernel", "shape": [1024, 1024], "dtype": "float32"}, {"name": "sequential/dense_1/bias", "shape": [1024], "dtype": "float32"}, {"name": "sequential/dense_2/kernel", "shape": [1024, 3], "dtype": "float32"}, {"name": "sequential/dense_2/bias", "shape": [3], "dtype": "float32"}]}]}